Белгипрозем_2017/src/InformationRegisters/ОбщиеРеквизитыДокументов/ОбщиеРеквизитыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбщиеРеквизитыДокументов</name>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КорреспондентыДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыОбработкиДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержитОригинал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокИсполнения</name>
    <comment>Ожидаемый срок ответа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ВидыВнутреннихДокументов/ВидыВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДоговораЗемлеустроительныхРабот</name>
      <description>Договора землеустроительных работ</description>
    </items>
    <items>
      <name>ДокументыТехархива</name>
      <description>Документы техархива</description>
    </items>
    <items>
      <name>ДопСоглашения</name>
      <description>Дополнительные соглашения</description>
    </items>
    <items>
      <name>АктВыбора</name>
      <description>Акт выбора</description>
    </items>
    <items>
      <name>АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Дело</name>
      <description>Дело</description>
    </items>
    <items>
      <name>ДелоУслуги</name>
      <description>Дело-услуги</description>
    </items>
    <items>
      <name>Нормализация</name>
      <description>Нормализация</description>
    </items>
  </predefined>
  <attributes>
    <name>АвтоматическиВестиСоставУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоАдресатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоКорреспондентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСтатьямДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключенУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьСозданиеДокументовНеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭтапыОбработкиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенФайлОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеРабочихГруппДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеУказаниеОтветственного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьРезолюцииЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНедействующиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСрокДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСуммуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКомплектомДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДопСоглашением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/ДелопроизводствоСобытия/Module.bsl
// Обработчик подписки на событие ЗаписатьОбщиеРеквизитыДокументов.
//
Процедура ЗаписатьОбщиеРеквизитыДокументов(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
        Возврат;  
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	КорреспондентыДляСписков = "";
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
		
		КорреспондентыДляСписков = Делопроизводство.ПолучитьКорреспондентовДляСписков(
			Источник.Получатели.Выгрузить(), "Получатель");
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
		
//1С-Минск +
		//КорреспондентыДляСписков = Делопроизводство.ПолучитьКорреспондентовДляСписков(
		//	Источник.Корреспонденты.Выгрузить());
		ДобавитьКонтактныхЛицИПодписантов(Источник, КорреспондентыДляСписков);
//1С-Минск - 	
	КонецЕсли;	
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеРеквизитыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Источник.Ссылка;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Документ 				= Источник.Ссылка;
	МенеджерЗаписи.РегистрационныйНомер 	= Источник.РегистрационныйНомер;
	МенеджерЗаписи.ДатаРегистрации 			= Источник.ДатаРегистрации;
	МенеджерЗаписи.Сумма 					= Источник.Сумма;
	МенеджерЗаписи.Валюта 					= Источник.Валюта;
	МенеджерЗаписи.СрокИсполнения 			= Источник.СрокИсполнения;
    МенеджерЗаписи.Заголовок 				= Источник.Заголовок;
	МенеджерЗаписи.КорреспондентыДляСписков = КорреспондентыДляСписков;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ДобавитьКонтактныхЛицИПодписантов(Источник, КорреспондентыДляСписков) 
	// Добавление Контактных лиц, подписантов, Корреспондентов и Инвесторов
	СписокДобавленных = новый СписокЗначений;
	
	ДобавитьКонтактныхЛицИПодписантовИзТаблицы(Источник.Корреспонденты, КорреспондентыДляСписков, СписокДобавленных);
	ДобавитьКонтактныхЛицИПодписантовИзТаблицы(Источник.Инвесторы, КорреспондентыДляСписков, СписокДобавленных);
	
	Если Источник.ВидДокумента = Справочники.ВидыВнутреннихДокументов.ДелоУслуги Тогда
		ЭтоФизЛицо = мРаботаСДоговорами.ЭтоФизЛицо(Источник.мЗаказчик);
		ДобавитьКорреспондента(Источник.мЗаказчик, ЭтоФизЛицо, КорреспондентыДляСписков, СписокДобавленных);
	КонецЕсли; 
КонецПроцедуры

Процедура ДобавитьКонтактныхЛицИПодписантовИзТаблицы(ТаблицаИсточник, КорреспондентыДляСписков, СписокДобавленных) 
	Для каждого Стр Из ТаблицаИсточник Цикл
		ЭтоФизЛицо = мРаботаСДоговорами.ЭтоФизЛицо(Стр.Корреспондент);
		ДобавитьКорреспондента(Стр.Корреспондент, ЭтоФизЛицо, КорреспондентыДляСписков, СписокДобавленных);
		
		Если ЗначениеЗаполнено(Стр.КонтактноеЛицо) Тогда
			ДобавитьФизЛицо(Стр.КонтактноеЛицо, КорреспондентыДляСписков, СписокДобавленных);
		КонецЕсли; 
		Если ЗначениеЗаполнено(Стр.ПодписалОтКорреспондента) Тогда
			ДобавитьФизЛицо(Стр.ПодписалОтКорреспондента, КорреспондентыДляСписков, СписокДобавленных);
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
 
Процедура ДобавитьКорреспондента(Корреспондент, ЭтоФизЛицо, КорреспондентыДляСписков, СписокДобавленных) 
	Если ЭтоФизЛицо Тогда
		ИскЗначение = СписокДобавленных.НайтиПоЗначению(Корреспондент.ФизЛицо);
		Если ИскЗначение = Неопределено Тогда
			СписокДобавленных.Добавить(Корреспондент.ФизЛицо);
			КорреспондентыДляСписков = КорреспондентыДляСписков	+ ?(КорреспондентыДляСписков = "", "", ", ")
			+ СокрЛП(Корреспондент.ПолноеНаименование);
		КонецЕсли; 
	Иначе	
		ИскЗначение = СписокДобавленных.НайтиПоЗначению(Корреспондент);
		Если ИскЗначение = Неопределено Тогда
			СписокДобавленных.Добавить(Корреспондент);
			КорреспондентыДляСписков = КорреспондентыДляСписков	+ ?(КорреспондентыДляСписков = "", "", ", ")
			+ СокрЛП(Корреспондент.ПолноеНаименование);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ДобавитьФизЛицо(Контакт, КорреспондентыДляСписков, СписокДобавленных)
	Если ЗначениеЗаполнено(Контакт.ФизЛицо) Тогда
		ИскЗначение = СписокДобавленных.НайтиПоЗначению(Контакт.ФизЛицо);
		Если ИскЗначение = Неопределено Тогда
			СписокДобавленных.Добавить(Контакт.ФизЛицо);
			КорреспондентыДляСписков = КорреспондентыДляСписков	+ ?(КорреспондентыДляСписков = "", "", ", ")
			+ СокрЛП(Контакт.Наименование);
		КонецЕсли; 
	Иначе	
		ИскЗначение = СписокДобавленных.НайтиПоЗначению(Контакт.Наименование);
		Если ИскЗначение = Неопределено Тогда
			СписокДобавленных.Добавить(Контакт.Наименование);
			КорреспондентыДляСписков = КорреспондентыДляСписков	+ ?(КорреспондентыДляСписков = "", "", ", ")
			+ СокрЛП(Контакт.Наименование);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
